# IsModifiable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationDimensionDefinition..::..IsModifiable Property
FabricationDimensionDefinition Class See Also
---
If the fabrication dimension is modifiable by user.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsModifiable { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsModifiable As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsModifiable {
	bool get ();
}
```

# See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace